import{_ as e}from"./plugin-vue_export-helper-DlAUqK2U.js";import{o as i,c as n,e as o}from"./app-CYOwO63N.js";const r={},t=o(`<p>Цикли є керуючими конструкціями, дозволяючи в залежності від певних умов виконувати деяку дію багато разів. У C# є такі види циклів:</p><ul><li>for</li><li>foreach</li><li>while</li><li>do...while</li></ul><h2 id="цикл-for" tabindex="-1"><a class="header-anchor" href="#цикл-for"><span>Цикл for</span></a></h2><p>Цикл for має таке формальне визначення:</p><pre><code>for ([дії_до_виконання_циклу]; [умова]; [дії_після_виконання])
{
     // дії
}
</code></pre><p>Оголошення циклу for складається із трьох частин. Перша частина оголошення циклу – деякі дії, які виконуються один раз до виконання циклу. Зазвичай тут визначаються змінні, які будуть використовуватись у циклі.</p><p>Друга частина - умова, за якої виконуватиметься цикл. Поки умова дорівнює true, виконуватиметься цикл.</p><p>І третя частина - деякі дії, які виконуються після завершення блоку циклу. Ці дії виконуються щоразу після завершення блоку циклу.</p><p>Після оголошення циклу у фігурних дужках розміщуються самі дії циклу.</p><p>Розглянемо стандартний цикл for:</p><pre><code>for (int i = 1; i &lt; 4; i++)
{
     Console.WriteLine(i);
}
</code></pre><p>Тут перша частина оголошення циклу - int i = 1 - створює та ініціалізує змінну i.</p><p>Друга частина - умова i &lt; 4. Тобто доки змінна i менше 4, виконуватиметься цикл.</p><p>І третя частина - дії, що виконуються після завершення дій з блоку циклу - збільшення змінної i на одиницю.</p><p>Весь процес циклу можна представити так:</p><ol><li>Визначається змінна int i = 1</li><li>Перевіряється умова i &lt; 4. Вона істинна (оскільки 1 менше 4), тому виконується блок циклу, а саме інструкція Console.WriteLine(i), яка виводить на консоль значення змінної i</li><li>Блок циклу закінчив виконання, тому виконується третя частина оголошення циклу - i++. Після цього змінна i дорівнюватиме 2.</li><li>Знову перевіряється умова i &lt; 4. Вона істинна (оскільки 2 менше 4), тому знову виконується блок циклу - Console.WriteLine(i)</li><li>Блок циклу закінчив виконання, тому знову виконується вираз i++. Після цього змінна i дорівнюватиме 3.</li><li>Знову перевіряється умова i &lt; 4. Вона істинна (оскільки 3 менше 4), тому знову виконується блок циклу - Console.WriteLine(i)</li><li>Блок циклу закінчив виконання, тому знову виконується вираз i++. Після цього змінна i дорівнюватиме 4.</li><li>Знову перевіряється умова i &lt; 4. Тепер вона буде false, оскільки значення змінної i НЕ менше 4, тому цикл завершує виконання. Далі вже виконується решта програми, яка йде після циклу</li></ol><p>У результаті блок циклу спрацює 3 рази, поки значення i не стане рівним 4. І щоразу це значення збільшуватиметься на 1. Одноразове виконання блоку циклу називається ітерацією. Таким чином, тут цикл виконає три ітерації. Результат роботи програми:</p><pre><code>1
2
3
</code></pre><p>Якщо блок циклу for містить одну інструкцію, ми можемо його скоротити, прибравши фігурні дужки:</p><pre><code>for (int i = 1; i &lt; 4; i++)
     Console.WriteLine(i);
 
// або так
for (int i = 1; i &lt; 4; i++) Console.WriteLine(i);
</code></pre><p>При цьому необов&#39;язково саме у першій частині циклу оголошувати змінну, а в третій частині змінювати її значення - це можуть бути будь-які дії. Наприклад:</p><pre><code>var i = 1;
 
for (Console.WriteLine(&quot;Початок виконання циклу&quot;); i &lt; 4; Console.WriteLine($&quot;i = {i}&quot;))
{
     i++;
}
</code></pre><p>Тут знову ж таки цикл спрацьовує, поки змінна i менше 4, тільки збільшення змінної i відбувається в блоці циклу. Консольний вивід цієї програми:</p><pre><code>Початок виконання циклу
i = 2
i = 3
i = 4
</code></pre><p>Нам необов&#39;язково вказувати всі умови під час оголошення циклу. Наприклад, ми можемо написати так:</p><pre><code>int i = 1;
for (; ;)
{
     Console.WriteLine($&quot;i = {i}&quot;);
     i++;
}
</code></pre><p>Формально визначення циклу залишилося тим самим, тільки тепер блоки у визначенні у нас порожні: for(;😉. У нас немає ініціалізованої змінної, немає умови, тому цикл працюватиме вічно – нескінченний цикл.</p><p>Ми також можемо опустити ряд блоків:</p><pre><code>int i = 1;
for (; i&lt;4;)
{
     Console.WriteLine($&quot;i = {i}&quot;);
     i++;
}
</code></pre><p>Цей приклад по суті еквівалентний першому прикладу: у нас також є змінна-лічильник, тільки визначена вона поза циклом. Ми маємо умову виконання циклу. І є збільшення змінної вже в самому блоці for.</p><p>Також варто зазначити, що можна визначати кілька змінних в оголошенні циклу:</p><pre><code>for (int i = 1, j = 1; i &lt; 10; i++, j++)
     Console.WriteLine($&quot;{i*j}&quot;);
</code></pre><p>Тут у першій частині оголошення циклу визначаються дві змінні: i та j. Цикл виконується, поки i не дорівнюватиме 10. Після кожної ітерації змінні i та j збільшуються на одиницю. Консольний вивід програми:</p><pre><code>1
4
9
16
25
36
49
64
81
</code></pre><h2 id="цикл-do-while" tabindex="-1"><a class="header-anchor" href="#цикл-do-while"><span>Цикл do..while</span></a></h2><p>У циклі do спочатку виконується код циклу, потім відбувається перевірка умови в інструкції while. І поки ця умова є істинною, цикл повторюється.</p><pre><code>do
{
     дії циклу
}
while (умова)
</code></pre><p>Наприклад:</p><pre><code>int i = 6;
do
{
     Console.WriteLine(i);
     i--;
}
while (i &gt; 0);
</code></pre><p>Тут код циклу спрацює 6 разів, доки i не стане рівним нулю. Але важливо зазначити, що цикл do гарантує хоча б одноразове виконання дій, навіть якщо умова в конструкції while не буде істинно. Тобто ми можемо написати:</p><pre><code>int i = -1;
do
{
     Console.WriteLine(i);
     i--;
}
while (i &gt; 0);
</code></pre><p>Хоча у нас змінна i менше 0, цикл все одно один раз виконається.</p><h2 id="цикл-while" tabindex="-1"><a class="header-anchor" href="#цикл-while"><span>Цикл while</span></a></h2><p>На відміну від циклу do цикл while відразу перевіряє істинність деякої умови, і якщо умова істинна, то код циклу виконується:</p><pre><code>while (умова)
{
     дії циклу
}
</code></pre><p>Наприклад:</p><pre><code>int i = 6;
while (i &gt; 0)
{
     Console.WriteLine(i);
     i--;
}
</code></pre><h2 id="цикл-foreach" tabindex="-1"><a class="header-anchor" href="#цикл-foreach"><span>Цикл foreach</span></a></h2><p>Цикл foreach призначений для вибору набору або колекції елементів. Його загальне визначення:</p><pre><code>foreach(тип_даних змінна in колекція)
{
     // дії циклу
}
</code></pre><p>Після оператора foreach у дужках спочатку йде визначення змінної. Потім ключове слово in і далі колекція, елементи якої потрібно перебрати.</p><p>При виконанні цикл послідовно перебирає елементи колекції і поміщає їх у змінну, і в блоці циклу ми можемо виконати з ними деякі дії.</p><p>Наприклад, візьмемо рядок. Рядок по суті – це колекція символів. І .NET дозволяє перебрати всі елементи рядка - його символи за допомогою циклу foreach.</p><pre><code>foreach(char c in &quot;Tom&quot;)
{
     Console.WriteLine(c);
}
</code></pre><p>Тут цикл foreach пробігається по всіх символах рядка &quot;Tom&quot; і кожен символ поміщає в символьну змінну c. У блоці циклу значення змінної c виводиться на консоль. Оскільки в рядку &quot;Tom&quot; три символи, цикл виконається три рази. Консольний висновок програми:</p><pre><code>T
o
m
</code></pre><p>Варто зазначити, що змінна, яка визначається в оголошенні циклу, повинна за типом відповідати типу елементів колекції, що перебирається. Так, елементи рядка – значення типу char – символи. Тому змінна c має тип char. Проте насправді не завжди буває очевидно, який тип представляють елементи колекції. У цьому випадку ми можемо визначити змінну за допомогою оператора var:</p><pre><code>foreach(var c in &quot;Tom&quot;)
{
     Console.WriteLine(c);
}
</code></pre><h2 id="оператори-continue-та-break" tabindex="-1"><a class="header-anchor" href="#оператори-continue-та-break"><span>Оператори continue та break</span></a></h2><p>Іноді виникає ситуація, коли потрібно вийти з циклу, не чекаючи на його завершення. І тут ми можемо скористатися оператором break.</p><p>Наприклад:</p><pre><code>for (int i = 0; i &lt; 9; i++)
{
     if (i == 5)
         break;
     Console.WriteLine(i);
}
</code></pre><p>Хоча за умови циклу сказано, що цикл виконуватиметься, доки лічильник i не досягне значення 9, насправді цикл спрацює 5 разів. Так як при досягненні лічильником i значення 5 спрацює оператор break, і цикл завершиться.</p><pre><code>0
1
2
3
4
</code></pre><p>Тепер поставимо собі інше завдання. А якщо ми хочемо, щоб під час перевірки цикл не завершувався, а просто пропускав поточну ітерацію. Для цього ми можемо скористатися оператором continue:</p><pre><code>for (int i = 0; i &lt; 9; i++)
{
     if (i == 5)
         continue;
     Console.WriteLine(i);
}
</code></pre><p>У цьому випадку цикл, коли дійде до числа 5, яке не задовольняє умову перевірки, просто пропустить це число та перейде до наступної ітерації:</p><pre><code>0
1
2
3
4
6
7
8
</code></pre><p>Варто зазначити, що оператори break і continue можна використовувати в будь-якому типі циклів.</p><h2 id="вкладені-цикли" tabindex="-1"><a class="header-anchor" href="#вкладені-цикли"><span>Вкладені цикли</span></a></h2><p>Одні цикли можуть бути вкладені в інші. Наприклад:</p><pre><code>for (int i = 1; i &lt; 10; i++)
{
     for (int j = 1; j &lt; 10; j++)
     {
         Console.Write($&quot;{i*j}\\t&quot;);
     }
     Console.WriteLine();
}
</code></pre><p>В даному випадку, цикл for (int i = 1; i &lt; 10; i++) виконується 9 разів, тобто має 9 ітерацій. Але у межах кожної ітерації виконується дев&#39;ять разів вкладений цикл for (int j = 1; j &lt; 10; j++). У результаті програма виведе таблицю множення.</p>`,73),p=[t];function l(c,a){return i(),n("div",null,p)}const s=e(r,[["render",l],["__file","topic10.html.vue"]]),f=JSON.parse('{"path":"/theory/theory2/topic10.html","title":"Цикли","lang":"en-US","frontmatter":{"title":"Цикли"},"headers":[{"level":2,"title":"Цикл for","slug":"цикл-for","link":"#цикл-for","children":[]},{"level":2,"title":"Цикл do..while","slug":"цикл-do-while","link":"#цикл-do-while","children":[]},{"level":2,"title":"Цикл while","slug":"цикл-while","link":"#цикл-while","children":[]},{"level":2,"title":"Цикл foreach","slug":"цикл-foreach","link":"#цикл-foreach","children":[]},{"level":2,"title":"Оператори continue та break","slug":"оператори-continue-та-break","link":"#оператори-continue-та-break","children":[]},{"level":2,"title":"Вкладені цикли","slug":"вкладені-цикли","link":"#вкладені-цикли","children":[]}],"git":{"createdTime":1712559663000,"updatedTime":1712875693000,"contributors":[{"name":"VasylMartynWork","email":"killermbjustthink@gmail.com","commits":2}]},"readingTime":{"minutes":4.02,"words":1206},"filePathRelative":"theory/theory2/topic10.md","localizedDate":"April 8, 2024"}');export{s as comp,f as data};
