import{_ as e}from"./plugin-vue_export-helper-DlAUqK2U.js";import{o as n,c as o,f as t}from"./app-CX4iMBMp.js";const i={},r=t(`<p>Літерали представляють незмінні значення (іноді ще називають константами). Літерали можна передавати змінним як значення. Літерали бувають логічними, цілими, речовими, символьними і рядковими. І окремий літерал є ключовим словом null.</p><h2 id="логічні-літерали" tabindex="-1"><a class="header-anchor" href="#логічні-літерали"><span>Логічні літерали</span></a></h2><p>Є дві логічні константи - true (істина) і false (брехня):</p><pre><code>Console.WriteLine(true);
Console.WriteLine(false);
</code></pre><h2 id="цілочисленні-літерали" tabindex="-1"><a class="header-anchor" href="#цілочисленні-літерали"><span>Цілочисленні літерали</span></a></h2><p>Цілочисленні літерали представляють позитивні та негативні цілі числа, наприклад, 1, 2, 3, 4, -7, -109. Цілочисленні літерали можуть бути виражені в десятковій, шістнадцятковій та двійковій формі.</p><p>З цілими числами в десятковій формі все має бути зрозумілим, тому що вони використовуються в повсякденному житті:</p><pre><code>Console.WriteLine(-11);
Console.WriteLine(5);
Console.WriteLine(505);
</code></pre><p>Числа у двійковій формі передуються символами 0b, після яких йде набір з нулів та одиниць:</p><pre><code>Console.WriteLine(0b11); // 3
Console.WriteLine(0b1011); // 11
Console.WriteLine(0b100001); // 33
</code></pre><p>Для запису числа у шістнадцятковій формі застосовуються символи 0x, після яких йде набір символів від 0 до 9 і від A до F, які власне представляють число:</p><pre><code>Console.WriteLine(0x0A); // 10
Console.WriteLine(0xFF); // 255
Console.WriteLine(0xA1); // 161
</code></pre><h2 id="речові-літерали" tabindex="-1"><a class="header-anchor" href="#речові-літерали"><span>Речові літерали</span></a></h2><p>Речові літерали є дробовими числами. Цей тип літералів має дві форми. Перша форма - речові числа з фіксованою комою, при якій дробова частина відокремлюється від цілої частини крапкою. Наприклад:</p><pre><code>3.14
100.001
-0.38
</code></pre><p>Також речові літерали можуть визначатися в експоненційній формі MEp, де M - мантиса, E - експонента, яка фактично означає &quot;*10^&quot; (помножити на десять в ступені), а p - порядок. Наприклад:</p><pre><code>Console.WriteLine(3.2e3); // по суті дорівнює 3.2*10^3 = 3200
Console.WriteLine(1.2E-1); // одно 1.2 * 10^-1 = 0.12
</code></pre><h2 id="символьні-літерали" tabindex="-1"><a class="header-anchor" href="#символьні-літерали"><span>Символьні літерали</span></a></h2><p>Символьні літерали є одиночними символами. Символи розміщуються у одинарних лапках.</p><p>Символьні літерали бувають кількох видів. Насамперед це звичайні символи:</p><pre><code>&#39;2&#39;
&#39;A&#39;
&#39;T&#39;
</code></pre><p>Також ми можемо вивести їх на консоль за допомогою Console.WriteLine:</p><pre><code>Console.WriteLine(&#39;2&#39;);
Console.WriteLine(&#39;A&#39;);
Console.WriteLine(&#39;T&#39;);
</code></pre><p>Спеціальну групу представляють керуючі послідовності. Керуюча послідовність - це символ, перед яким ставиться слеш. І ця послідовність інтерпретується певним чином. Найчастіше використовувані послідовності:</p><pre><code>&#39;\\n&#39; - перехід на новий рядок

&#39;\\t&#39; - табуляція

&#39;\\\\&#39; - слеш
</code></pre><p>І якщо компілятор зустріне в тексті послідовність \\t, то він сприйматиме цю послідовність не як слеш і букву t, а як табуляцію - тобто довгий відступ.</p><p>Також символи можуть визначатися у вигляді шістнадцяткових кодів, також вкладених в одинарні лапки.</p><p>Ще один спосіб визначення символів представляє використання шістнадцяткових кодів ASCII. Для цього в одинарних лапках вказуються символи x, після яких йде шістнадцятковий код символу з таблиці ASCII.</p><p>Наприклад, літерал &quot;x78&quot; представляє символ &quot;x&quot;:</p><pre><code>Console.WriteLine(&#39;x78&#39;); // x
Console.WriteLine(&#39;x5A&#39;); // Z
</code></pre><p>І останній спосіб визначення символьних літералів - це застосування кодів з таблиці символів Unicode. Для цього в одинарних лапках вказуються символи &#39;\\u&#39;, після яких йде шістнадцятковий код Unicode. Наприклад, код &#39;\\u0411&#39; представляє кириличний символ &#39;Б&#39;:</p><pre><code>Console.WriteLine(&#39;\\u0420&#39;); // Р
Console.WriteLine(&#39;\\u0421&#39;); // З
</code></pre><h2 id="рядкові-літерали" tabindex="-1"><a class="header-anchor" href="#рядкові-літерали"><span>Рядкові літерали</span></a></h2><p>Рядкові літерали представляють рядки. Рядки полягають у подвійні лапки:</p><pre><code>Console.WriteLine(&quot;hello&quot;);
Console.WriteLine(&quot;Фива&quot;);
Console.WriteLine(&quot;hello word&quot;);
</code></pre><p>Якщо всередині рядка необхідно вивести подвійну лапку, то така внутрішня лапка буде стояти після зворотного слешу:</p><pre><code>Console.WriteLine(&quot;Компанія \\&quot;Роги і копита\\&quot;&quot;);
</code></pre><p>Також у рядках можна використовувати керуючі послідовності. Наприклад, послідовність &#39;\\n&#39; здійснює перехід на новий рядок:</p><pre><code>Console.WriteLine(&quot;Привіт \\nсвіт&quot;);
</code></pre><p>При виведенні на консоль слово &quot;світ&quot; буде перенесено на новий рядок:</p><pre><code>Привіт
світ
</code></pre><h2 id="null" tabindex="-1"><a class="header-anchor" href="#null"><span>null</span></a></h2><p>null представляє посилання, яке не вказує на жодний об&#39;єкт. Тобто, по суті, відсутність значення.</p>`,43),l=[r];function p(s,a){return n(),o("div",null,l)}const h=e(i,[["render",p],["__file","topic3.html.vue"]]),u=JSON.parse('{"path":"/theory/theory2/topic3.html","title":"Літерали","lang":"en-US","frontmatter":{"title":"Літерали"},"headers":[{"level":2,"title":"Логічні літерали","slug":"логічні-літерали","link":"#логічні-літерали","children":[]},{"level":2,"title":"Цілочисленні літерали","slug":"цілочисленні-літерали","link":"#цілочисленні-літерали","children":[]},{"level":2,"title":"Речові літерали","slug":"речові-літерали","link":"#речові-літерали","children":[]},{"level":2,"title":"Символьні літерали","slug":"символьні-літерали","link":"#символьні-літерали","children":[]},{"level":2,"title":"Рядкові літерали","slug":"рядкові-літерали","link":"#рядкові-літерали","children":[]},{"level":2,"title":"null","slug":"null","link":"#null","children":[]}],"git":{"createdTime":1712559663000,"updatedTime":1712559663000,"contributors":[{"name":"VasylMartynWork","email":"killermbjustthink@gmail.com","commits":1}]},"readingTime":{"minutes":1.73,"words":520},"filePathRelative":"theory/theory2/topic3.md","localizedDate":"April 8, 2024"}');export{h as comp,u as data};
